Revit 2027 API
RebarContainerType.GetOrCreateRebarContainerType Method
 Creates or returns a RebarContainerType object with a given name.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ElementId GetOrCreateRebarContainerType(
	Document aDoc,
	string name
)
Public Shared Function GetOrCreateRebarContainerType (
	aDoc As Document,
	name As String
) As ElementId
public:
static ElementId^ GetOrCreateRebarContainerType(
	Document^ aDoc,
	String^ name
)
static member GetOrCreateRebarContainerType :
        aDoc : Document *
        name : string -> ElementId
Parameters
aDoc Document
 The document.
name String
 Name of the type.
Return Value
ElementId
 The type id.
Exceptions
Exception | Condition
ArgumentException |  name is an empty string.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarContainerType Class
Autodesk.Revit.DB.Structure Namespace